wolfgangz2013/rt-thread/bsp/HC32F146x_STK/Libraries/CMSIS/HC32FM14/Include/HC32M140JX.h
#define bM0P_EXTINT_INTLVL_LVLH3                        *((volatile unsigned int*)(0x4260019CUL))
#define bM0P_EXTINT_INTLVL_LVLL4                        *((volatile unsigned int*)(0x426001A0UL))
#define bM0P_EXTINT_INTLVL_LVLH4                        *((volatile unsigned int*)(0x426001A4UL))
#define bM0P_EXTINT_INTLVL_LVLL5                        *((volatile unsigned int*)(0x426001A8UL))
#define bM0P_EXTINT_INTLVL_LVLH5                        *((volatile unsigned int*)(0x426001ACUL))
#define bM0P_EXTINT_INTLVL_LVLL6                        *((volatile unsigned int*)(0x426001B0UL))
#define bM0P_EXTINT_INTLVL_LVLH6                        *((volatile unsigned int*)(0x426001B4UL))
#define bM0P_EXTINT_INTLVL_LVLL7                        *((volatile unsigned int*)(0x426001B8UL))
#define bM0P_EXTINT_INTLVL_LVLH7                        *((volatile unsigned int*)(0x426001BCUL))
#define bM0P_EXTINT_INTLVL_LVLL8                        *((volatile unsigned int*)(0x426001C0UL))
#define bM0P_EXTINT_INTLVL_LVLH8                        *((volatile unsigned int*)(0x426001C4UL))
#define bM0P_EXTINT_INTLVL_LVLL9                        *((volatile unsigned int*)(0x426001C8UL))
#define bM0P_EXTINT_INTLVL_LVLH9                        *((volatile unsigned int*)(0x426001CCUL))
#define bM0P_EXTINT_INTLVL_LVLL10                       *((volatile unsigned int*)(0x426001D0UL))
#define bM0P_EXTINT_INTLVL_LVLH10                       *((volatile unsigned int*)(0x426001D4UL))
#define bM0P_EXTINT_INTLVL_LVLL11                       *((volatile unsigned int*)(0x426001D8UL))
#define bM0P_EXTINT_INTLVL_LVLH11                       *((volatile unsigned int*)(0x426001DCUL))
#define bM0P_EXTINT_INTLVL_LVLL12                       *((volatile unsigned int*)(0x426001E0UL))
#define bM0P_EXTINT_INTLVL_LVLH12                       *((volatile unsigned int*)(0x426001E4UL))
#define bM0P_EXTINT_INTLVL_LVLL13                       *((volatile unsigned int*)(0x426001E8UL))
#define bM0P_EXTINT_INTLVL_LVLH13                       *((volatile unsigned int*)(0x426001ECUL))
#define bM0P_EXTINT_INTLVL_LVLL14                       *((volatile unsigned int*)(0x426001F0UL))
#define bM0P_EXTINT_INTLVL_LVLH14                       *((volatile unsigned int*)(0x426001F4UL))
#define bM0P_EXTINT_INTLVL_LVLL15                       *((volatile unsigned int*)(0x426001F8UL))
#define bM0P_EXTINT_INTLVL_LVLH15                       *((volatile unsigned int*)(0x426001FCUL))
#define bM0P_EXTINT_NMISRC_SRC                          *((volatile unsigned int*)(0x42600280UL))
#define bM0P_EXTINT_NMICLR_CLR                          *((volatile unsigned int*)(0x42600300UL))
#define bM0P_FLASH_IF_FOCR_PRGM                         *((volatile unsigned int*)(0x42000000UL))
#define bM0P_FLASH_IF_FOCR_PERS                         *((volatile unsigned int*)(0x42000004UL))
#define bM0P_FLASH_IF_FOCR_CERS                         *((volatile unsigned int*)(0x42000008UL))
#define bM0P_FLASH_IF_FOCR_DPSTB                        *((volatile unsigned int*)(0x4200000CUL))
#define bM0P_FLASH_IF_FOCR_PER_EN                       *((volatile unsigned int*)(0x42000014UL))
#define bM0P_FLASH_IF_FOCR_FRWPW0                       *((volatile unsigned int*)(0x42000040UL))
#define bM0P_FLASH_IF_FOCR_FRWPW1                       *((volatile unsigned int*)(0x42000044UL))
#define bM0P_FLASH_IF_FOCR_FRWPW2                       *((volatile unsigned int*)(0x42000048UL))
#define bM0P_FLASH_IF_FOCR_FRWPW3                       *((volatile unsigned int*)(0x4200004CUL))
#define bM0P_FLASH_IF_FOCR_FRWPW4                       *((volatile unsigned int*)(0x42000050UL))
#define bM0P_FLASH_IF_FOCR_FRWPW5                       *((volatile unsigned int*)(0x42000054UL))
#define bM0P_FLASH_IF_FOCR_FRWPW6                       *((volatile unsigned int*)(0x42000058UL))
#define bM0P_FLASH_IF_FOCR_FRWPW7                       *((volatile unsigned int*)(0x4200005CUL))
#define bM0P_FLASH_IF_FOCR_FRWPW8                       *((volatile unsigned int*)(0x42000060UL))
#define bM0P_FLASH_IF_FOCR_FRWPW9                       *((volatile unsigned int*)(0x42000064UL))
#define bM0P_FLASH_IF_FOCR_FRWPW10                      *((volatile unsigned int*)(0x42000068UL))
#define bM0P_FLASH_IF_FOCR_FRWPW11                      *((volatile unsigned int*)(0x4200006CUL))
#define bM0P_FLASH_IF_FOCR_FRWPW12                      *((volatile unsigned int*)(0x42000070UL))
#define bM0P_FLASH_IF_FOCR_FRWPW13                      *((volatile unsigned int*)(0x42000074UL))
#define bM0P_FLASH_IF_FOCR_FRWPW14                      *((volatile unsigned int*)(0x42000078UL))
#define bM0P_FLASH_IF_FOCR_FRWPW15                      *((volatile unsigned int*)(0x4200007CUL))
#define bM0P_FLASH_IF_FSTR_BUSY                         *((volatile unsigned int*)(0x42000180UL))
#define bM0P_FLASH_IF_FSTR_KEYVIO                       *((volatile unsigned int*)(0x42000184UL))
#define bM0P_FLASH_IF_FSTR_ACCVIO                       *((volatile unsigned int*)(0x42000188UL))
#define bM0P_FLASH_IF_FSTR_ERR                          *((volatile unsigned int*)(0x4200018CUL))
#define bM0P_FLASH_IF_FSTR_OPVIO                        *((volatile unsigned int*)(0x42000190UL))
#define bM0P_FLASH_IF_FSTR_FRWPW0                       *((volatile unsigned int*)(0x420001C0UL))
#define bM0P_FLASH_IF_FSTR_FRWPW1                       *((volatile unsigned int*)(0x420001C4UL))
#define bM0P_FLASH_IF_FSTR_FRWPW2                       *((volatile unsigned int*)(0x420001C8UL))
#define bM0P_FLASH_IF_FSTR_FRWPW3                       *((volatile unsigned int*)(0x420001CCUL))
#define bM0P_FLASH_IF_FSTR_FRWPW4                       *((volatile unsigned int*)(0x420001D0UL))
#define bM0P_FLASH_IF_FSTR_FRWPW5                       *((volatile unsigned int*)(0x420001D4UL))
#define bM0P_FLASH_IF_FSTR_FRWPW6                       *((volatile unsigned int*)(0x420001D8UL))
#define bM0P_FLASH_IF_FSTR_FRWPW7                       *((volatile unsigned int*)(0x420001DCUL))
#define bM0P_FLASH_IF_FSTR_FRWPW8                       *((volatile unsigned int*)(0x420001E0UL))
#define bM0P_FLASH_IF_FSTR_FRWPW9                       *((volatile unsigned int*)(0x420001E4UL))
#define bM0P_FLASH_IF_FSTR_FRWPW10                      *((volatile unsigned int*)(0x420001E8UL))
#define bM0P_FLASH_IF_FSTR_FRWPW11                      *((volatile unsigned int*)(0x420001ECUL))
#define bM0P_FLASH_IF_FSTR_FRWPW12                      *((volatile unsigned int*)(0x420001F0UL))
#define bM0P_FLASH_IF_FSTR_FRWPW13                      *((volatile unsigned int*)(0x420001F4UL))
#define bM0P_FLASH_IF_FSTR_FRWPW14                      *((volatile unsigned int*)(0x420001F8UL))
#define bM0P_FLASH_IF_FSTR_FRWPW15                      *((volatile unsigned int*)(0x420001FCUL))
#define bM0P_FLASH_IF_FWCICR_FIE                        *((volatile unsigned int*)(0x42000200UL))
#define bM0P_FLASH_IF_FWCICR_FWTC0                      *((volatile unsigned int*)(0x42000210UL))
#define bM0P_FLASH_IF_FWCICR_FWTC1                      *((volatile unsigned int*)(0x42000214UL))
#define bM0P_FLASH_IF_FUDR0_F4M_ITC0                    *((volatile unsigned int*)(0x420002A0UL))
#define bM0P_FLASH_IF_FUDR0_F4M_ITC1                    *((volatile unsigned int*)(0x420002A4UL))
#define bM0P_FLASH_IF_FUDR0_F4M_ITC2                    *((volatile unsigned int*)(0x420002A8UL))
#define bM0P_FLASH_IF_FUDR0_F4M_ITC3                    *((volatile unsigned int*)(0x420002ACUL))
#define bM0P_FLASH_IF_FUDR0_F4M_OPT0                    *((volatile unsigned int*)(0x420002C0UL))
#define bM0P_FLASH_IF_FUDR0_F4M_OPT1                    *((volatile unsigned int*)(0x420002C4UL))
#define bM0P_FLASH_IF_FUDR0_F4M_OPT2                    *((volatile unsigned int*)(0x420002C8UL))
#define bM0P_FLASH_IF_FUDR0_F4M_OPT3                    *((volatile unsigned int*)(0x420002CCUL))
#define bM0P_FLASH_IF_FUDR0_F4M_OPT4                    *((volatile unsigned int*)(0x420002D0UL))
#define bM0P_FLASH_IF_FUDR0_F4M_OPT5                    *((volatile unsigned int*)(0x420002D4UL))
#define bM0P_FLASH_IF_FUDR0_F4M_OPT6                    *((volatile unsigned int*)(0x420002D8UL))
#define bM0P_FLASH_IF_FUDR0_F4M_OPT7                    *((volatile unsigned int*)(0x420002DCUL))
#define bM0P_FLASH_IF_TNVS_TNVS0                        *((volatile unsigned int*)(0x42000480UL))
#define bM0P_FLASH_IF_TNVS_TNVS1                        *((volatile unsigned int*)(0x42000484UL))
#define bM0P_FLASH_IF_TNVS_TNVS2                        *((volatile unsigned int*)(0x42000488UL))
#define bM0P_FLASH_IF_TNVS_TNVS3                        *((volatile unsigned int*)(0x4200048CUL))
#define bM0P_FLASH_IF_TNVS_TNVS4                        *((volatile unsigned int*)(0x42000490UL))
#define bM0P_FLASH_IF_TNVS_TNVS5                        *((volatile unsigned int*)(0x42000494UL))
#define bM0P_FLASH_IF_TNVS_TNVS6                        *((volatile unsigned int*)(0x42000498UL))
#define bM0P_FLASH_IF_TNVS_TNVS7                        *((volatile unsigned int*)(0x4200049CUL))
#define bM0P_FLASH_IF_TNVS_TNVS8                        *((volatile unsigned int*)(0x420004A0UL))
#define bM0P_FLASH_IF_TPROG_TPROG0                      *((volatile unsigned int*)(0x42000500UL))
#define bM0P_FLASH_IF_TPROG_TPROG1                      *((volatile unsigned int*)(0x42000504UL))
#define bM0P_FLASH_IF_TPROG_TPROG2                      *((volatile unsigned int*)(0x42000508UL))
#define bM0P_FLASH_IF_TPROG_TPROG3                      *((volatile unsigned int*)(0x4200050CUL))
#define bM0P_FLASH_IF_TPROG_TPROG4                      *((volatile unsigned int*)(0x42000510UL))
#define bM0P_FLASH_IF_TPROG_TPROG5                      *((volatile unsigned int*)(0x42000514UL))
#define bM0P_FLASH_IF_TPROG_TPROG6                      *((volatile unsigned int*)(0x42000518UL))
#define bM0P_FLASH_IF_TPROG_TPROG7                      *((volatile unsigned int*)(0x4200051CUL))
#define bM0P_FLASH_IF_TPROG_TPROG8                      *((volatile unsigned int*)(0x42000520UL))
#define bM0P_FLASH_IF_TPGS_TPGS0                        *((volatile unsigned int*)(0x42000580UL))
#define bM0P_FLASH_IF_TPGS_TPGS1                        *((volatile unsigned int*)(0x42000584UL))
#define bM0P_FLASH_IF_TPGS_TPGS2                        *((volatile unsigned int*)(0x42000588UL))
#define bM0P_FLASH_IF_TPGS_TPGS3                        *((volatile unsigned int*)(0x4200058CUL))
#define bM0P_FLASH_IF_TPGS_TPGS4                        *((volatile unsigned int*)(0x42000590UL))
#define bM0P_FLASH_IF_TPGS_TPGS5                        *((volatile unsigned int*)(0x42000594UL))
#define bM0P_FLASH_IF_TPGS_TPGS6                        *((volatile unsigned int*)(0x42000598UL))
#define bM0P_FLASH_IF_TPGS_TPGS7                        *((volatile unsigned int*)(0x4200059CUL))
#define bM0P_FLASH_IF_TPGS_TPGS8                        *((volatile unsigned int*)(0x420005A0UL))
#define bM0P_FLASH_IF_TRCVPGM_TRCVPGM0                  *((volatile unsigned int*)(0x42000600UL))
#define bM0P_FLASH_IF_TRCVPGM_TRCVPGM1                  *((volatile unsigned int*)(0x42000604UL))
#define bM0P_FLASH_IF_TRCVPGM_TRCVPGM2                  *((volatile unsigned int*)(0x42000608UL))
#define bM0P_FLASH_IF_TRCVPGM_TRCVPGM3                  *((volatile unsigned int*)(0x4200060CUL))
#define bM0P_FLASH_IF_TRCVPGM_TRCVPGM4                  *((volatile unsigned int*)(0x42000610UL))
#define bM0P_FLASH_IF_TRCVPGM_TRCVPGM5                  *((volatile unsigned int*)(0x42000614UL))
#define bM0P_FLASH_IF_TRCVPGM_TRCVPGM6                  *((volatile unsigned int*)(0x42000618UL))
#define bM0P_FLASH_IF_TRCVPGM_TRCVPGM7                  *((volatile unsigned int*)(0x4200061CUL))
#define bM0P_FLASH_IF_TRCVPGM_TRCVPGM8                  *((volatile unsigned int*)(0x42000620UL))
#define bM0P_FLASH_IF_TRCVPERS_TRCVPERS0                *((volatile unsigned int*)(0x42000680UL))
#define bM0P_FLASH_IF_TRCVPERS_TRCVPERS1                *((volatile unsigned int*)(0x42000684UL))
#define bM0P_FLASH_IF_TRCVPERS_TRCVPERS2                *((volatile unsigned int*)(0x42000688UL))
#define bM0P_FLASH_IF_TRCVPERS_TRCVPERS3                *((volatile unsigned int*)(0x4200068CUL))
#define bM0P_FLASH_IF_TRCVPERS_TRCVPERS4                *((volatile unsigned int*)(0x42000690UL))
#define bM0P_FLASH_IF_TRCVPERS_TRCVPERS5                *((volatile unsigned int*)(0x42000694UL))
#define bM0P_FLASH_IF_TRCVPERS_TRCVPERS6                *((volatile unsigned int*)(0x42000698UL))
#define bM0P_FLASH_IF_TRCVPERS_TRCVPERS7                *((volatile unsigned int*)(0x4200069CUL))
#define bM0P_FLASH_IF_TRCVPERS_TRCVPERS8                *((volatile unsigned int*)(0x420006A0UL))
#define bM0P_FLASH_IF_TRCVCERS_TRCVCERS0                *((volatile unsigned int*)(0x42000700UL))
#define bM0P_FLASH_IF_TRCVCERS_TRCVCERS1                *((volatile unsigned int*)(0x42000704UL))
#define bM0P_FLASH_IF_TRCVCERS_TRCVCERS2                *((volatile unsigned int*)(0x42000708UL))
#define bM0P_FLASH_IF_TRCVCERS_TRCVCERS3                *((volatile unsigned int*)(0x4200070CUL))
#define bM0P_FLASH_IF_TRCVCERS_TRCVCERS4                *((volatile unsigned int*)(0x42000710UL))
#define bM0P_FLASH_IF_TRCVCERS_TRCVCERS5                *((volatile unsigned int*)(0x42000714UL))
#define bM0P_FLASH_IF_TRCVCERS_TRCVCERS6                *((volatile unsigned int*)(0x42000718UL))
#define bM0P_FLASH_IF_TRCVCERS_TRCVCERS7                *((volatile unsigned int*)(0x4200071CUL))
#define bM0P_FLASH_IF_TRCVCERS_TRCVCERS8                *((volatile unsigned int*)(0x42000720UL))
#define bM0P_FLASH_IF_TPERS_TPERS0                      *((volatile unsigned int*)(0x42000780UL))
#define bM0P_FLASH_IF_TPERS_TPERS1                      *((volatile unsigned int*)(0x42000784UL))
#define bM0P_FLASH_IF_TPERS_TPERS2                      *((volatile unsigned int*)(0x42000788UL))
#define bM0P_FLASH_IF_TPERS_TPERS3                      *((volatile unsigned int*)(0x4200078CUL))
#define bM0P_FLASH_IF_TPERS_TPERS4                      *((volatile unsigned int*)(0x42000790UL))
#define bM0P_FLASH_IF_TPERS_TPERS5                      *((volatile unsigned int*)(0x42000794UL))
#define bM0P_FLASH_IF_TPERS_TPERS6                      *((volatile unsigned int*)(0x42000798UL))
#define bM0P_FLASH_IF_TPERS_TPERS7                      *((volatile unsigned int*)(0x4200079CUL))
#define bM0P_FLASH_IF_TPERS_TPERS8                      *((volatile unsigned int*)(0x420007A0UL))
#define bM0P_FLASH_IF_TCERS_TCERS0                      *((volatile unsigned int*)(0x42000800UL))
#define bM0P_FLASH_IF_TCERS_TCERS1                      *((volatile unsigned int*)(0x42000804UL))
#define bM0P_FLASH_IF_TCERS_TCERS2                      *((volatile unsigned int*)(0x42000808UL))
#define bM0P_FLASH_IF_TCERS_TCERS3                      *((volatile unsigned int*)(0x4200080CUL))
#define bM0P_FLASH_IF_TCERS_TCERS4                      *((volatile unsigned int*)(0x42000810UL))
#define bM0P_FLASH_IF_TCERS_TCERS5                      *((volatile unsigned int*)(0x42000814UL))
#define bM0P_FLASH_IF_TCERS_TCERS6                      *((volatile unsigned int*)(0x42000818UL))
#define bM0P_FLASH_IF_TCERS_TCERS7                      *((volatile unsigned int*)(0x4200081CUL))
#define bM0P_FLASH_IF_TCERS_TCERS8                      *((volatile unsigned int*)(0x42000820UL))
#define bM0P_GPIO_FN0_P03                               *((volatile unsigned int*)(0x4266000CUL))
#define bM0P_GPIO_FN0_P04                               *((volatile unsigned int*)(0x42660010UL))
#define bM0P_GPIO_FN0_P05                               *((volatile unsigned int*)(0x42660014UL))
#define bM0P_GPIO_FN0_P06                               *((volatile unsigned int*)(0x42660018UL))
#define bM0P_GPIO_FN0_P07                               *((volatile unsigned int*)(0x4266001CUL))
#define bM0P_GPIO_FN1_P10                               *((volatile unsigned int*)(0x42660080UL))
#define bM0P_GPIO_FN1_P11                               *((volatile unsigned int*)(0x42660084UL))
#define bM0P_GPIO_FN1_P12                               *((volatile unsigned int*)(0x42660088UL))
#define bM0P_GPIO_FN1_P13                               *((volatile unsigned int*)(0x4266008CUL))
#define bM0P_GPIO_FN1_P14                               *((volatile unsigned int*)(0x42660090UL))
#define bM0P_GPIO_FN1_P15                               *((volatile unsigned int*)(0x42660094UL))
#define bM0P_GPIO_FN1_P16                               *((volatile unsigned int*)(0x42660098UL))
#define bM0P_GPIO_FN2_P20                               *((volatile unsigned int*)(0x42660100UL))
#define bM0P_GPIO_FN2_P21                               *((volatile unsigned int*)(0x42660104UL))
#define bM0P_GPIO_FN2_P22                               *((volatile unsigned int*)(0x42660108UL))
#define bM0P_GPIO_FN2_P23                               *((volatile unsigned int*)(0x4266010CUL))
#define bM0P_GPIO_FN2_P24                               *((volatile unsigned int*)(0x42660110UL))
#define bM0P_GPIO_FN3_P30                               *((volatile unsigned int*)(0x42660180UL))
#define bM0P_GPIO_FN3_P31                               *((volatile unsigned int*)(0x42660184UL))
#define bM0P_GPIO_FN3_P32                               *((volatile unsigned int*)(0x42660188UL))
#define bM0P_GPIO_FN4_P40                               *((volatile unsigned int*)(0x42660200UL))
#define bM0P_GPIO_FN4_P41                               *((volatile unsigned int*)(0x42660204UL))
#define bM0P_GPIO_FN4_P42                               *((volatile unsigned int*)(0x42660208UL))
#define bM0P_GPIO_FN4_P43                               *((volatile unsigned int*)(0x4266020CUL))
#define bM0P_GPIO_FN4_P44                               *((volatile unsigned int*)(0x42660210UL))
#define bM0P_GPIO_FN4_P45                               *((volatile unsigned int*)(0x42660214UL))
#define bM0P_GPIO_FN4_P46                               *((volatile unsigned int*)(0x42660218UL))
#define bM0P_GPIO_FN4_P47                               *((volatile unsigned int*)(0x4266021CUL))
#define bM0P_GPIO_FN5_P50                               *((volatile unsigned int*)(0x42660280UL))
#define bM0P_GPIO_FN5_P51                               *((volatile unsigned int*)(0x42660284UL))
#define bM0P_GPIO_FN5_P52                               *((volatile unsigned int*)(0x42660288UL))
#define bM0P_GPIO_FN6_P60                               *((volatile unsigned int*)(0x42660300UL))
#define bM0P_GPIO_FN6_P61                               *((volatile unsigned int*)(0x42660304UL))
#define bM0P_GPIO_FN6_P62                               *((volatile unsigned int*)(0x42660308UL))
#define bM0P_GPIO_FN6_P63                               *((volatile unsigned int*)(0x4266030CUL))
#define bM0P_GPIO_FN6_P64                               *((volatile unsigned int*)(0x42660310UL))
#define bM0P_GPIO_FN6_P65                               *((volatile unsigned int*)(0x42660314UL))
#define bM0P_GPIO_FN7_P70                               *((volatile unsigned int*)(0x42660380UL))
#define bM0P_GPIO_FN7_P71                               *((volatile unsigned int*)(0x42660384UL))
#define bM0P_GPIO_FN7_P72                               *((volatile unsigned int*)(0x42660388UL))
#define bM0P_GPIO_FN7_P73                               *((volatile unsigned int*)(0x4266038CUL))
#define bM0P_GPIO_FN7_P74                               *((volatile unsigned int*)(0x42660390UL))
#define bM0P_GPIO_FN7_P75                               *((volatile unsigned int*)(0x42660394UL))
#define bM0P_GPIO_PU0_P03                               *((volatile unsigned int*)(0x4266200CUL))
#define bM0P_GPIO_PU0_P04                               *((volatile unsigned int*)(0x42662010UL))
#define bM0P_GPIO_PU0_P05                               *((volatile unsigned int*)(0x42662014UL))
#define bM0P_GPIO_PU0_P06                               *((volatile unsigned int*)(0x42662018UL))
#define bM0P_GPIO_PU0_P07                               *((volatile unsigned int*)(0x4266201CUL))
#define bM0P_GPIO_PU1_P10                               *((volatile unsigned int*)(0x42662080UL))
#define bM0P_GPIO_PU1_P11                               *((volatile unsigned int*)(0x42662084UL))
#define bM0P_GPIO_PU1_P12                               *((volatile unsigned int*)(0x42662088UL))
#define bM0P_GPIO_PU1_P13                               *((volatile unsigned int*)(0x4266208CUL))
#define bM0P_GPIO_PU1_P14                               *((volatile unsigned int*)(0x42662090UL))
#define bM0P_GPIO_PU1_P15                               *((volatile unsigned int*)(0x42662094UL))
#define bM0P_GPIO_PU1_P16                               *((volatile unsigned int*)(0x42662098UL))
#define bM0P_GPIO_PU2_P21                               *((volatile unsigned int*)(0x42662104UL))
#define bM0P_GPIO_PU2_P22                               *((volatile unsigned int*)(0x42662108UL))
#define bM0P_GPIO_PU2_P23                               *((volatile unsigned int*)(0x4266210CUL))
#define bM0P_GPIO_PU2_P24                               *((volatile unsigned int*)(0x42662110UL))
#define bM0P_GPIO_PU3_P30                               *((volatile unsigned int*)(0x42662180UL))
#define bM0P_GPIO_PU3_P31                               *((volatile unsigned int*)(0x42662184UL))
#define bM0P_GPIO_PU3_P32                               *((volatile unsigned int*)(0x42662188UL))
#define bM0P_GPIO_PU4_P40                               *((volatile unsigned int*)(0x42662200UL))
#define bM0P_GPIO_PU4_P41                               *((volatile unsigned int*)(0x42662204UL))
#define bM0P_GPIO_PU4_P42                               *((volatile unsigned int*)(0x42662208UL))
#define bM0P_GPIO_PU4_P43                               *((volatile unsigned int*)(0x4266220CUL))
#define bM0P_GPIO_PU4_P44                               *((volatile unsigned int*)(0x42662210UL))
#define bM0P_GPIO_PU4_P45                               *((volatile unsigned int*)(0x42662214UL))
#define bM0P_GPIO_PU4_P46                               *((volatile unsigned int*)(0x42662218UL))
#define bM0P_GPIO_PU4_P47                               *((volatile unsigned int*)(0x4266221CUL))
#define bM0P_GPIO_PU5_P50                               *((volatile unsigned int*)(0x42662280UL))
#define bM0P_GPIO_PU5_P51                               *((volatile unsigned int*)(0x42662284UL))
#define bM0P_GPIO_PU5_P52                               *((volatile unsigned int*)(0x42662288UL))
#define bM0P_GPIO_PU6_P60                               *((volatile unsigned int*)(0x42662300UL))
#define bM0P_GPIO_PU6_P61                               *((volatile unsigned int*)(0x42662304UL))
#define bM0P_GPIO_PU6_P62                               *((volatile unsigned int*)(0x42662308UL))
#define bM0P_GPIO_PU6_P63                               *((volatile unsigned int*)(0x4266230CUL))
#define bM0P_GPIO_PU6_P64                               *((volatile unsigned int*)(0x42662310UL))
#define bM0P_GPIO_PU6_P65                               *((volatile unsigned int*)(0x42662314UL))
#define bM0P_GPIO_PU7_P70                               *((volatile unsigned int*)(0x42662380UL))
#define bM0P_GPIO_PU7_P71                               *((volatile unsigned int*)(0x42662384UL))
#define bM0P_GPIO_PU7_P72                               *((volatile unsigned int*)(0x42662388UL))
#define bM0P_GPIO_PU7_P73                               *((volatile unsigned int*)(0x4266238CUL))
#define bM0P_GPIO_PU7_P74                               *((volatile unsigned int*)(0x42662390UL))
#define bM0P_GPIO_PU7_P75                               *((volatile unsigned int*)(0x42662394UL))
#define bM0P_GPIO_DIR0_P03                              *((volatile unsigned int*)(0x4266400CUL))
#define bM0P_GPIO_DIR0_P04                              *((volatile unsigned int*)(0x42664010UL))
#define bM0P_GPIO_DIR0_P05                              *((volatile unsigned int*)(0x42664014UL))
