wolfgangz2013/rt-thread/bsp/HC32F146x_STK/Libraries/CMSIS/HC32FM14/Include/HC32M140JX.h
#define bM0P_PCG_RSTCTL0_MSC5RST                        *((volatile unsigned int*)(0x42782094UL))
#define bM0P_PCG_RSTCTL0_MSC6RST                        *((volatile unsigned int*)(0x42782098UL))
#define bM0P_PCG_RSTCTL0_ADCRST                         *((volatile unsigned int*)(0x427820C0UL))
#define bM0P_PCG_RSTCTL0_DMARST                         *((volatile unsigned int*)(0x427820E0UL))
#define bM0P_PCG_CLKEN1_CTCK                            *((volatile unsigned int*)(0x42782200UL))
#define bM0P_PCG_CLKEN1_VCCK                            *((volatile unsigned int*)(0x42782210UL))
#define bM0P_PCG_CLKEN1_TM4CK                           *((volatile unsigned int*)(0x42782220UL))
#define bM0P_PCG_CLKEN1_OPA0CK                          *((volatile unsigned int*)(0x42782230UL))
#define bM0P_PCG_CLKEN1_OPA1CK                          *((volatile unsigned int*)(0x42782234UL))
#define bM0P_PCG_RSTCTL1_CTMRST                         *((volatile unsigned int*)(0x42782280UL))
#define bM0P_PCG_RSTCTL1_VCRST                          *((volatile unsigned int*)(0x42782290UL))
#define bM0P_PCG_RSTCTL1_TM4RST                         *((volatile unsigned int*)(0x427822A0UL))
#define bM0P_PCG_RSTCTL1_OPA0RST                        *((volatile unsigned int*)(0x427822B0UL))
#define bM0P_PCG_RSTCTL1_OPA1RST                        *((volatile unsigned int*)(0x427822B4UL))
#define bM0P_PCG_CLKEN2_LCDCCK                          *((volatile unsigned int*)(0x42782440UL))
#define bM0P_PCG_RSTCTL2_LCDCRST                        *((volatile unsigned int*)(0x427824C0UL))
#define bM0P_SWWDT_WDT_CTL_IE                           *((volatile unsigned int*)(0x42240100UL))
#define bM0P_SWWDT_WDT_CTL_RSTEN                        *((volatile unsigned int*)(0x42240104UL))
#define bM0P_SWWDT_WDT_CTL_TMWD0                        *((volatile unsigned int*)(0x42240108UL))
#define bM0P_SWWDT_WDT_CTL_TMWD1                        *((volatile unsigned int*)(0x4224010CUL))
#define bM0P_SWWDT_WDT_CTL_WDM                          *((volatile unsigned int*)(0x42240110UL))
#define bM0P_SWWDT_WDT_STA_STA                          *((volatile unsigned int*)(0x42240200UL))
#define bM0P_SWWDT_WDT_MDC_TRG                          *((volatile unsigned int*)(0x42240300UL))
#define bM0P_TIMER4_OCSR10_OCE0                         *((volatile unsigned int*)(0x42400300UL))
#define bM0P_TIMER4_OCSR10_OCE1                         *((volatile unsigned int*)(0x42400304UL))
#define bM0P_TIMER4_OCSR10_OCP0                         *((volatile unsigned int*)(0x42400308UL))
#define bM0P_TIMER4_OCSR10_OCP1                         *((volatile unsigned int*)(0x4240030CUL))
#define bM0P_TIMER4_OCSR10_OCIE0                        *((volatile unsigned int*)(0x42400310UL))
#define bM0P_TIMER4_OCSR10_OCIE1                        *((volatile unsigned int*)(0x42400314UL))
#define bM0P_TIMER4_OCSR10_OCF0                         *((volatile unsigned int*)(0x42400318UL))
#define bM0P_TIMER4_OCSR10_OCF1                         *((volatile unsigned int*)(0x4240031CUL))
#define bM0P_TIMER4_OCER10_C0BUFEN0                     *((volatile unsigned int*)(0x42400340UL))
#define bM0P_TIMER4_OCER10_C0BUFEN1                     *((volatile unsigned int*)(0x42400344UL))
#define bM0P_TIMER4_OCER10_C1BUFEN0                     *((volatile unsigned int*)(0x42400348UL))
#define bM0P_TIMER4_OCER10_C1BUFEN1                     *((volatile unsigned int*)(0x4240034CUL))
#define bM0P_TIMER4_OCER10_M0BUFEN0                     *((volatile unsigned int*)(0x42400350UL))
#define bM0P_TIMER4_OCER10_M0BUFEN1                     *((volatile unsigned int*)(0x42400354UL))
#define bM0P_TIMER4_OCER10_M1BUFEN0                     *((volatile unsigned int*)(0x42400358UL))
#define bM0P_TIMER4_OCER10_M1BUFEN1                     *((volatile unsigned int*)(0x4240035CUL))
#define bM0P_TIMER4_OCER10_LMC0                         *((volatile unsigned int*)(0x42400360UL))
#define bM0P_TIMER4_OCER10_LMC1                         *((volatile unsigned int*)(0x42400364UL))
#define bM0P_TIMER4_OCER10_LMM0                         *((volatile unsigned int*)(0x42400368UL))
#define bM0P_TIMER4_OCER10_LMM1                         *((volatile unsigned int*)(0x4240036CUL))
#define bM0P_TIMER4_OCER10_MCEC0                        *((volatile unsigned int*)(0x42400370UL))
#define bM0P_TIMER4_OCER10_MCEC1                        *((volatile unsigned int*)(0x42400374UL))
#define bM0P_TIMER4_OCSR32_OCE0                         *((volatile unsigned int*)(0x42400380UL))
#define bM0P_TIMER4_OCSR32_OCE1                         *((volatile unsigned int*)(0x42400384UL))
#define bM0P_TIMER4_OCSR32_OCP0                         *((volatile unsigned int*)(0x42400388UL))
#define bM0P_TIMER4_OCSR32_OCP1                         *((volatile unsigned int*)(0x4240038CUL))
#define bM0P_TIMER4_OCSR32_OCIE0                        *((volatile unsigned int*)(0x42400390UL))
#define bM0P_TIMER4_OCSR32_OCIE1                        *((volatile unsigned int*)(0x42400394UL))
#define bM0P_TIMER4_OCSR32_OCF0                         *((volatile unsigned int*)(0x42400398UL))
#define bM0P_TIMER4_OCSR32_OCF1                         *((volatile unsigned int*)(0x4240039CUL))
#define bM0P_TIMER4_OCER32_C0BUFEN0                     *((volatile unsigned int*)(0x424003C0UL))
#define bM0P_TIMER4_OCER32_C0BUFEN1                     *((volatile unsigned int*)(0x424003C4UL))
#define bM0P_TIMER4_OCER32_C1BUFEN0                     *((volatile unsigned int*)(0x424003C8UL))
#define bM0P_TIMER4_OCER32_C1BUFEN1                     *((volatile unsigned int*)(0x424003CCUL))
#define bM0P_TIMER4_OCER32_M0BUFEN0                     *((volatile unsigned int*)(0x424003D0UL))
#define bM0P_TIMER4_OCER32_M0BUFEN1                     *((volatile unsigned int*)(0x424003D4UL))
#define bM0P_TIMER4_OCER32_M1BUFEN0                     *((volatile unsigned int*)(0x424003D8UL))
#define bM0P_TIMER4_OCER32_M1BUFEN1                     *((volatile unsigned int*)(0x424003DCUL))
#define bM0P_TIMER4_OCER32_LMC0                         *((volatile unsigned int*)(0x424003E0UL))
#define bM0P_TIMER4_OCER32_LMC1                         *((volatile unsigned int*)(0x424003E4UL))
#define bM0P_TIMER4_OCER32_LMM0                         *((volatile unsigned int*)(0x424003E8UL))
#define bM0P_TIMER4_OCER32_LMM1                         *((volatile unsigned int*)(0x424003ECUL))
#define bM0P_TIMER4_OCER32_MCEC0                        *((volatile unsigned int*)(0x424003F0UL))
#define bM0P_TIMER4_OCER32_MCEC1                        *((volatile unsigned int*)(0x424003F4UL))
#define bM0P_TIMER4_OCSR54_OCE0                         *((volatile unsigned int*)(0x42400400UL))
#define bM0P_TIMER4_OCSR54_OCE1                         *((volatile unsigned int*)(0x42400404UL))
#define bM0P_TIMER4_OCSR54_OCP0                         *((volatile unsigned int*)(0x42400408UL))
#define bM0P_TIMER4_OCSR54_OCP1                         *((volatile unsigned int*)(0x4240040CUL))
#define bM0P_TIMER4_OCSR54_OCIE0                        *((volatile unsigned int*)(0x42400410UL))
#define bM0P_TIMER4_OCSR54_OCIE1                        *((volatile unsigned int*)(0x42400414UL))
#define bM0P_TIMER4_OCSR54_OCF0                         *((volatile unsigned int*)(0x42400418UL))
#define bM0P_TIMER4_OCSR54_OCF1                         *((volatile unsigned int*)(0x4240041CUL))
#define bM0P_TIMER4_OCER54_C0BUFEN0                     *((volatile unsigned int*)(0x42400440UL))
#define bM0P_TIMER4_OCER54_C0BUFEN1                     *((volatile unsigned int*)(0x42400444UL))
#define bM0P_TIMER4_OCER54_C1BUFEN0                     *((volatile unsigned int*)(0x42400448UL))
#define bM0P_TIMER4_OCER54_C1BUFEN1                     *((volatile unsigned int*)(0x4240044CUL))
#define bM0P_TIMER4_OCER54_M0BUFEN0                     *((volatile unsigned int*)(0x42400450UL))
#define bM0P_TIMER4_OCER54_M0BUFEN1                     *((volatile unsigned int*)(0x42400454UL))
#define bM0P_TIMER4_OCER54_M1BUFEN0                     *((volatile unsigned int*)(0x42400458UL))
#define bM0P_TIMER4_OCER54_M1BUFEN1                     *((volatile unsigned int*)(0x4240045CUL))
#define bM0P_TIMER4_OCER54_LMC0                         *((volatile unsigned int*)(0x42400460UL))
#define bM0P_TIMER4_OCER54_LMC1                         *((volatile unsigned int*)(0x42400464UL))
#define bM0P_TIMER4_OCER54_LMM0                         *((volatile unsigned int*)(0x42400468UL))
#define bM0P_TIMER4_OCER54_LMM1                         *((volatile unsigned int*)(0x4240046CUL))
#define bM0P_TIMER4_OCER54_MCEC0                        *((volatile unsigned int*)(0x42400470UL))
#define bM0P_TIMER4_OCER54_MCEC1                        *((volatile unsigned int*)(0x42400474UL))
#define bM0P_TIMER4_OCMR0_OCMR0                         *((volatile unsigned int*)(0x42400480UL))
#define bM0P_TIMER4_OCMR0_OCMR1                         *((volatile unsigned int*)(0x42400484UL))
#define bM0P_TIMER4_OCMR0_OCMR2                         *((volatile unsigned int*)(0x42400488UL))
#define bM0P_TIMER4_OCMR0_OCMR3                         *((volatile unsigned int*)(0x4240048CUL))
#define bM0P_TIMER4_OCMR0_OCMR4                         *((volatile unsigned int*)(0x42400490UL))
#define bM0P_TIMER4_OCMR0_OCMR5                         *((volatile unsigned int*)(0x42400494UL))
#define bM0P_TIMER4_OCMR0_OCMR6                         *((volatile unsigned int*)(0x42400498UL))
#define bM0P_TIMER4_OCMR0_OCMR7                         *((volatile unsigned int*)(0x4240049CUL))
#define bM0P_TIMER4_OCMR0_OCMR8                         *((volatile unsigned int*)(0x424004A0UL))
#define bM0P_TIMER4_OCMR0_OCMR9                         *((volatile unsigned int*)(0x424004A4UL))
#define bM0P_TIMER4_OCMR0_OCMR10                        *((volatile unsigned int*)(0x424004A8UL))
#define bM0P_TIMER4_OCMR0_OCMR11                        *((volatile unsigned int*)(0x424004ACUL))
#define bM0P_TIMER4_OCMR0_OCMR12                        *((volatile unsigned int*)(0x424004B0UL))
#define bM0P_TIMER4_OCMR0_OCMR13                        *((volatile unsigned int*)(0x424004B4UL))
#define bM0P_TIMER4_OCMR0_OCMR14                        *((volatile unsigned int*)(0x424004B8UL))
#define bM0P_TIMER4_OCMR0_OCMR15                        *((volatile unsigned int*)(0x424004BCUL))
#define bM0P_TIMER4_OCMR1_OCMR0                         *((volatile unsigned int*)(0x42400500UL))
#define bM0P_TIMER4_OCMR1_OCMR1                         *((volatile unsigned int*)(0x42400504UL))
#define bM0P_TIMER4_OCMR1_OCMR2                         *((volatile unsigned int*)(0x42400508UL))
#define bM0P_TIMER4_OCMR1_OCMR3                         *((volatile unsigned int*)(0x4240050CUL))
#define bM0P_TIMER4_OCMR1_OCMR4                         *((volatile unsigned int*)(0x42400510UL))
#define bM0P_TIMER4_OCMR1_OCMR5                         *((volatile unsigned int*)(0x42400514UL))
#define bM0P_TIMER4_OCMR1_OCMR6                         *((volatile unsigned int*)(0x42400518UL))
#define bM0P_TIMER4_OCMR1_OCMR7                         *((volatile unsigned int*)(0x4240051CUL))
#define bM0P_TIMER4_OCMR1_OCMR8                         *((volatile unsigned int*)(0x42400520UL))
#define bM0P_TIMER4_OCMR1_OCMR9                         *((volatile unsigned int*)(0x42400524UL))
#define bM0P_TIMER4_OCMR1_OCMR10                        *((volatile unsigned int*)(0x42400528UL))
#define bM0P_TIMER4_OCMR1_OCMR11                        *((volatile unsigned int*)(0x4240052CUL))
#define bM0P_TIMER4_OCMR1_OCMR12                        *((volatile unsigned int*)(0x42400530UL))
#define bM0P_TIMER4_OCMR1_OCMR13                        *((volatile unsigned int*)(0x42400534UL))
#define bM0P_TIMER4_OCMR1_OCMR14                        *((volatile unsigned int*)(0x42400538UL))
#define bM0P_TIMER4_OCMR1_OCMR15                        *((volatile unsigned int*)(0x4240053CUL))
#define bM0P_TIMER4_OCMR1_OCMR16                        *((volatile unsigned int*)(0x42400540UL))
#define bM0P_TIMER4_OCMR1_OCMR17                        *((volatile unsigned int*)(0x42400544UL))
#define bM0P_TIMER4_OCMR1_OCMR18                        *((volatile unsigned int*)(0x42400548UL))
#define bM0P_TIMER4_OCMR1_OCMR19                        *((volatile unsigned int*)(0x4240054CUL))
#define bM0P_TIMER4_OCMR1_OCMR20                        *((volatile unsigned int*)(0x42400550UL))
#define bM0P_TIMER4_OCMR1_OCMR21                        *((volatile unsigned int*)(0x42400554UL))
#define bM0P_TIMER4_OCMR1_OCMR22                        *((volatile unsigned int*)(0x42400558UL))
#define bM0P_TIMER4_OCMR1_OCMR23                        *((volatile unsigned int*)(0x4240055CUL))
#define bM0P_TIMER4_OCMR1_OCMR24                        *((volatile unsigned int*)(0x42400560UL))
#define bM0P_TIMER4_OCMR1_OCMR25                        *((volatile unsigned int*)(0x42400564UL))
#define bM0P_TIMER4_OCMR1_OCMR26                        *((volatile unsigned int*)(0x42400568UL))
#define bM0P_TIMER4_OCMR1_OCMR27                        *((volatile unsigned int*)(0x4240056CUL))
#define bM0P_TIMER4_OCMR1_OCMR28                        *((volatile unsigned int*)(0x42400570UL))
#define bM0P_TIMER4_OCMR1_OCMR29                        *((volatile unsigned int*)(0x42400574UL))
#define bM0P_TIMER4_OCMR1_OCMR30                        *((volatile unsigned int*)(0x42400578UL))
#define bM0P_TIMER4_OCMR1_OCMR31                        *((volatile unsigned int*)(0x4240057CUL))
#define bM0P_TIMER4_OCMR2_OCMR0                         *((volatile unsigned int*)(0x42400580UL))
#define bM0P_TIMER4_OCMR2_OCMR1                         *((volatile unsigned int*)(0x42400584UL))
#define bM0P_TIMER4_OCMR2_OCMR2                         *((volatile unsigned int*)(0x42400588UL))
#define bM0P_TIMER4_OCMR2_OCMR3                         *((volatile unsigned int*)(0x4240058CUL))
#define bM0P_TIMER4_OCMR2_OCMR4                         *((volatile unsigned int*)(0x42400590UL))
#define bM0P_TIMER4_OCMR2_OCMR5                         *((volatile unsigned int*)(0x42400594UL))
#define bM0P_TIMER4_OCMR2_OCMR6                         *((volatile unsigned int*)(0x42400598UL))
#define bM0P_TIMER4_OCMR2_OCMR7                         *((volatile unsigned int*)(0x4240059CUL))
#define bM0P_TIMER4_OCMR2_OCMR8                         *((volatile unsigned int*)(0x424005A0UL))
#define bM0P_TIMER4_OCMR2_OCMR9                         *((volatile unsigned int*)(0x424005A4UL))
#define bM0P_TIMER4_OCMR2_OCMR10                        *((volatile unsigned int*)(0x424005A8UL))
#define bM0P_TIMER4_OCMR2_OCMR11                        *((volatile unsigned int*)(0x424005ACUL))
#define bM0P_TIMER4_OCMR2_OCMR12                        *((volatile unsigned int*)(0x424005B0UL))
#define bM0P_TIMER4_OCMR2_OCMR13                        *((volatile unsigned int*)(0x424005B4UL))
#define bM0P_TIMER4_OCMR2_OCMR14                        *((volatile unsigned int*)(0x424005B8UL))
#define bM0P_TIMER4_OCMR2_OCMR15                        *((volatile unsigned int*)(0x424005BCUL))
#define bM0P_TIMER4_OCMR3_OCMR0                         *((volatile unsigned int*)(0x42400600UL))
#define bM0P_TIMER4_OCMR3_OCMR1                         *((volatile unsigned int*)(0x42400604UL))
#define bM0P_TIMER4_OCMR3_OCMR2                         *((volatile unsigned int*)(0x42400608UL))
#define bM0P_TIMER4_OCMR3_OCMR3                         *((volatile unsigned int*)(0x4240060CUL))
#define bM0P_TIMER4_OCMR3_OCMR4                         *((volatile unsigned int*)(0x42400610UL))
#define bM0P_TIMER4_OCMR3_OCMR5                         *((volatile unsigned int*)(0x42400614UL))
#define bM0P_TIMER4_OCMR3_OCMR6                         *((volatile unsigned int*)(0x42400618UL))
#define bM0P_TIMER4_OCMR3_OCMR7                         *((volatile unsigned int*)(0x4240061CUL))
#define bM0P_TIMER4_OCMR3_OCMR8                         *((volatile unsigned int*)(0x42400620UL))
#define bM0P_TIMER4_OCMR3_OCMR9                         *((volatile unsigned int*)(0x42400624UL))
#define bM0P_TIMER4_OCMR3_OCMR10                        *((volatile unsigned int*)(0x42400628UL))
#define bM0P_TIMER4_OCMR3_OCMR11                        *((volatile unsigned int*)(0x4240062CUL))
#define bM0P_TIMER4_OCMR3_OCMR12                        *((volatile unsigned int*)(0x42400630UL))
#define bM0P_TIMER4_OCMR3_OCMR13                        *((volatile unsigned int*)(0x42400634UL))
#define bM0P_TIMER4_OCMR3_OCMR14                        *((volatile unsigned int*)(0x42400638UL))
#define bM0P_TIMER4_OCMR3_OCMR15                        *((volatile unsigned int*)(0x4240063CUL))
#define bM0P_TIMER4_OCMR3_OCMR16                        *((volatile unsigned int*)(0x42400640UL))
#define bM0P_TIMER4_OCMR3_OCMR17                        *((volatile unsigned int*)(0x42400644UL))
#define bM0P_TIMER4_OCMR3_OCMR18                        *((volatile unsigned int*)(0x42400648UL))
#define bM0P_TIMER4_OCMR3_OCMR19                        *((volatile unsigned int*)(0x4240064CUL))
#define bM0P_TIMER4_OCMR3_OCMR20                        *((volatile unsigned int*)(0x42400650UL))
#define bM0P_TIMER4_OCMR3_OCMR21                        *((volatile unsigned int*)(0x42400654UL))
#define bM0P_TIMER4_OCMR3_OCMR22                        *((volatile unsigned int*)(0x42400658UL))
#define bM0P_TIMER4_OCMR3_OCMR23                        *((volatile unsigned int*)(0x4240065CUL))
#define bM0P_TIMER4_OCMR3_OCMR24                        *((volatile unsigned int*)(0x42400660UL))
#define bM0P_TIMER4_OCMR3_OCMR25                        *((volatile unsigned int*)(0x42400664UL))
#define bM0P_TIMER4_OCMR3_OCMR26                        *((volatile unsigned int*)(0x42400668UL))
#define bM0P_TIMER4_OCMR3_OCMR27                        *((volatile unsigned int*)(0x4240066CUL))
#define bM0P_TIMER4_OCMR3_OCMR28                        *((volatile unsigned int*)(0x42400670UL))
#define bM0P_TIMER4_OCMR3_OCMR29                        *((volatile unsigned int*)(0x42400674UL))
#define bM0P_TIMER4_OCMR3_OCMR30                        *((volatile unsigned int*)(0x42400678UL))
#define bM0P_TIMER4_OCMR3_OCMR31                        *((volatile unsigned int*)(0x4240067CUL))
#define bM0P_TIMER4_OCMR4_OCMR0                         *((volatile unsigned int*)(0x42400680UL))
#define bM0P_TIMER4_OCMR4_OCMR1                         *((volatile unsigned int*)(0x42400684UL))
#define bM0P_TIMER4_OCMR4_OCMR2                         *((volatile unsigned int*)(0x42400688UL))
#define bM0P_TIMER4_OCMR4_OCMR3                         *((volatile unsigned int*)(0x4240068CUL))
#define bM0P_TIMER4_OCMR4_OCMR4                         *((volatile unsigned int*)(0x42400690UL))
#define bM0P_TIMER4_OCMR4_OCMR5                         *((volatile unsigned int*)(0x42400694UL))
#define bM0P_TIMER4_OCMR4_OCMR6                         *((volatile unsigned int*)(0x42400698UL))
#define bM0P_TIMER4_OCMR4_OCMR7                         *((volatile unsigned int*)(0x4240069CUL))
#define bM0P_TIMER4_OCMR4_OCMR8                         *((volatile unsigned int*)(0x424006A0UL))
#define bM0P_TIMER4_OCMR4_OCMR9                         *((volatile unsigned int*)(0x424006A4UL))
#define bM0P_TIMER4_OCMR4_OCMR10                        *((volatile unsigned int*)(0x424006A8UL))
#define bM0P_TIMER4_OCMR4_OCMR11                        *((volatile unsigned int*)(0x424006ACUL))
#define bM0P_TIMER4_OCMR4_OCMR12                        *((volatile unsigned int*)(0x424006B0UL))
#define bM0P_TIMER4_OCMR4_OCMR13                        *((volatile unsigned int*)(0x424006B4UL))
#define bM0P_TIMER4_OCMR4_OCMR14                        *((volatile unsigned int*)(0x424006B8UL))
#define bM0P_TIMER4_OCMR4_OCMR15                        *((volatile unsigned int*)(0x424006BCUL))
#define bM0P_TIMER4_OCMR5_OCMR0                         *((volatile unsigned int*)(0x42400700UL))
#define bM0P_TIMER4_OCMR5_OCMR1                         *((volatile unsigned int*)(0x42400704UL))
#define bM0P_TIMER4_OCMR5_OCMR2                         *((volatile unsigned int*)(0x42400708UL))
#define bM0P_TIMER4_OCMR5_OCMR3                         *((volatile unsigned int*)(0x4240070CUL))
#define bM0P_TIMER4_OCMR5_OCMR4                         *((volatile unsigned int*)(0x42400710UL))
#define bM0P_TIMER4_OCMR5_OCMR5                         *((volatile unsigned int*)(0x42400714UL))
#define bM0P_TIMER4_OCMR5_OCMR6                         *((volatile unsigned int*)(0x42400718UL))
#define bM0P_TIMER4_OCMR5_OCMR7                         *((volatile unsigned int*)(0x4240071CUL))
#define bM0P_TIMER4_OCMR5_OCMR8                         *((volatile unsigned int*)(0x42400720UL))
#define bM0P_TIMER4_OCMR5_OCMR9                         *((volatile unsigned int*)(0x42400724UL))
#define bM0P_TIMER4_OCMR5_OCMR10                        *((volatile unsigned int*)(0x42400728UL))
#define bM0P_TIMER4_OCMR5_OCMR11                        *((volatile unsigned int*)(0x4240072CUL))
#define bM0P_TIMER4_OCMR5_OCMR12                        *((volatile unsigned int*)(0x42400730UL))
#define bM0P_TIMER4_OCMR5_OCMR13                        *((volatile unsigned int*)(0x42400734UL))
#define bM0P_TIMER4_OCMR5_OCMR14                        *((volatile unsigned int*)(0x42400738UL))
#define bM0P_TIMER4_OCMR5_OCMR15                        *((volatile unsigned int*)(0x4240073CUL))
#define bM0P_TIMER4_OCMR5_OCMR16                        *((volatile unsigned int*)(0x42400740UL))
#define bM0P_TIMER4_OCMR5_OCMR17                        *((volatile unsigned int*)(0x42400744UL))
#define bM0P_TIMER4_OCMR5_OCMR18                        *((volatile unsigned int*)(0x42400748UL))
#define bM0P_TIMER4_OCMR5_OCMR19                        *((volatile unsigned int*)(0x4240074CUL))
#define bM0P_TIMER4_OCMR5_OCMR20                        *((volatile unsigned int*)(0x42400750UL))
#define bM0P_TIMER4_OCMR5_OCMR21                        *((volatile unsigned int*)(0x42400754UL))
#define bM0P_TIMER4_OCMR5_OCMR22                        *((volatile unsigned int*)(0x42400758UL))
#define bM0P_TIMER4_OCMR5_OCMR23                        *((volatile unsigned int*)(0x4240075CUL))
#define bM0P_TIMER4_OCMR5_OCMR24                        *((volatile unsigned int*)(0x42400760UL))
#define bM0P_TIMER4_OCMR5_OCMR25                        *((volatile unsigned int*)(0x42400764UL))
#define bM0P_TIMER4_OCMR5_OCMR26                        *((volatile unsigned int*)(0x42400768UL))
#define bM0P_TIMER4_OCMR5_OCMR27                        *((volatile unsigned int*)(0x4240076CUL))
#define bM0P_TIMER4_OCMR5_OCMR28                        *((volatile unsigned int*)(0x42400770UL))
#define bM0P_TIMER4_OCMR5_OCMR29                        *((volatile unsigned int*)(0x42400774UL))
#define bM0P_TIMER4_OCMR5_OCMR30                        *((volatile unsigned int*)(0x42400778UL))
#define bM0P_TIMER4_OCMR5_OCMR31                        *((volatile unsigned int*)(0x4240077CUL))
#define bM0P_TIMER4_CCSR_DCLK0                          *((volatile unsigned int*)(0x42400900UL))
#define bM0P_TIMER4_CCSR_DCLK1                          *((volatile unsigned int*)(0x42400904UL))
#define bM0P_TIMER4_CCSR_DCLK2                          *((volatile unsigned int*)(0x42400908UL))
#define bM0P_TIMER4_CCSR_DCLK3                          *((volatile unsigned int*)(0x4240090CUL))
#define bM0P_TIMER4_CCSR_CLEAR                          *((volatile unsigned int*)(0x42400910UL))
#define bM0P_TIMER4_CCSR_CNTMD                          *((volatile unsigned int*)(0x42400914UL))
#define bM0P_TIMER4_CCSR_STOP                           *((volatile unsigned int*)(0x42400918UL))
#define bM0P_TIMER4_CCSR_BUFEN                          *((volatile unsigned int*)(0x4240091CUL))
#define bM0P_TIMER4_CCSR_ICLEN                          *((volatile unsigned int*)(0x42400920UL))
#define bM0P_TIMER4_CCSR_ICLR                           *((volatile unsigned int*)(0x42400924UL))
#define bM0P_TIMER4_CCSR_IRQZEN                         *((volatile unsigned int*)(0x42400934UL))
